#!/usr/bin/env ruby

tap "buildpacks/tap"
tap "hashicorp/tap"
tap "homebrew/command-not-found"

if OS.linux? then
    brew "checkstyle", args: ["ignore-dependencies"]
    brew "google-java-format", args: ["ignore-dependencies"]
    brew "pmd", args: ["ignore-dependencies"]

elsif OS.mac? then
    tap "snyk/tap"
    tap "sourcegraph/src-cli"

    brew "ack"
    brew "act"
    brew "advancecomp"
    brew "age"
    brew "aliyun-cli"
    brew "ant"
    brew "ares"
    brew "argo"
    brew "argocd"
    brew "aria2"
    brew "arkade"
    brew "arp-scan"
    brew "arping"
    brew "astyle"
    brew "atlas"
    brew "automake"
    brew "aws-cdk"
    brew "aws-sam-cli"
    brew "aws-shell"
    brew "awscli"
    brew "basex"
    brew "bash"
    brew "bash-completion@2"
    brew "bash_unit"
    brew "bat"
    brew "bc"
    brew "benerator"
    brew "binutils"
    brew "bison"
    brew "black"
    brew "brotli"
    brew "buf"
    brew "buildpacks/tap/pack"
    brew "byacc"
    brew "bzip2"
    brew "bzip3"
    brew "c"
    brew "cascadia"
    brew "cdk8s"
    brew "certigo"
    brew "chatblade"
    brew "checkbashisms"
    brew "checkstyle"
    brew "chrome-cli"
    brew "chrome-export"
    brew "clang-format"
    brew "click"
    brew "clive"
    brew "clusterctl"
    brew "cmake"
    brew "cmctl"
    brew "copa"
    brew "coreutils"
    brew "cosign"
    brew "crane"
    brew "creduce"
    brew "cscope"
    brew "csvkit"
    brew "csvprintf"
    brew "csvq"
    brew "cue"
    brew "curl"
    brew "cyphernetes"
    brew "d2"
    brew "dagger"
    brew "dash-shell"
    brew "ddrescue"
    brew "dependency-check"
    brew "devspace"
    brew "diff-pdf"
    brew "diffoscope"
    brew "diffstat"
    brew "difftastic"
    brew "diffutils"
    brew "dive"
    brew "dnscontrol"
    brew "dnstracer"
    brew "dockviz"
    brew "doggo"
    brew "dos2unix"
    brew "doxygen"
    brew "driftctl"
    brew "dsq"
    brew "dyld-headers"
    brew "dylibbundler"
    brew "ecoji"
    brew "ed"
    brew "eksctl"
    brew "erdtree"
    brew "eslint"
    brew "expect"
    brew "eza"
    brew "fd"
    brew "file-formula"
    brew "findutils"
    brew "firebase-cli"
    brew "fits"
    brew "flake8"
    brew "flex"
    brew "forcecli"
    brew "fselect"
    brew "fzf"
    brew "gator"
    brew "gawk"
    brew "gcc"
    brew "gh"
    brew "git"
    brew "git-delta"
    brew "git-lfs"
    brew "git-sizer"
    brew "gitg"
    brew "gitleaks"
    brew "gnu-getopt"
    brew "gnu-indent"
    brew "gnu-sed"
    brew "gnu-tar"
    brew "gnu-time"
    brew "gnu-units"
    brew "gnu-which"
    brew "gnupg"
    brew "go"
    brew "go-critic"
    brew "gojq"
    brew "google-java-format"
    brew "gops"
    brew "gosec"
    brew "gpatch"
    brew "gperf"
    brew "graphviz"
    brew "grc"
    brew "grep"
    brew "groff"
    brew "gron"
    brew "groovy"
    brew "grpc"
    brew "grpcurl"
    brew "gzip"
    brew "hashicorp/tap/packer"
    brew "hck"
    brew "helm"
    brew "hexyl"
    brew "hof"
    brew "hoverfly"
    brew "howdoi"
    brew "hq"
    brew "htop"
    brew "http-prompt"
    brew "httpd"
    brew "httpie"
    brew "httrack"
    brew "hurl"
    brew "hyperfine"
    brew "ijq"
    brew "imagemagick"
    brew "inetutils"
    brew "iproute2mac"
    brew "ipv6calc"
    brew "iredis"
    brew "irssi"
    brew "isort"
    brew "istioctl"
    brew "ivy"
    brew "jbang"
    brew "jd"
    brew "jfrog-cli"
    brew "jless"
    brew "johnnydep"
    brew "jq"
    brew "jsonlint"
    brew "jvm-mon"
    brew "jwt-cli"
    brew "k6"
    brew "k9s"
    brew "kind"
    brew "kops"
    brew "kotlin"
    brew "ksh93"
    brew "kube-linter"
    brew "kube-score"
    brew "kubecfg"
    brew "kubecm"
    brew "kubehound"
    brew "kubent"
    brew "kubergrunt"
    brew "kubernetes-cli"
    brew "kubesess"
    brew "kubevious"
    brew "kustomize"
    brew "kwok"
    brew "lemmeknow"
    brew "less"
    brew "libplist"
    brew "libressl"
    brew "libtermkey"
    brew "libvterm"
    brew "litecli"
    brew "lld"
    brew "llvm"
    brew "lorem"
    brew "lowdown"
    brew "ls-lint"
    brew "lsof"
    brew "lsusb"
    brew "luacheck"
    brew "lychee"
    brew "lz4"
    brew "lzip"
    brew "m4"
    brew "make"
    brew "man-db"
    brew "mandoc"
    brew "marp-cli"
    brew "masscan"
    brew "massren"
    brew "mat2"
    brew "maven"
    brew "maven-completion"
    brew "media-control"
    brew "mergiraf"
    brew "mg"
    brew "minikube"
    brew "minio-mc"
    brew "mintoolkit"
    brew "mist-cli"
    brew "mkcert"
    brew "mongosh"
    brew "moreutils"
    brew "mosh"
    brew "mprocs"
    brew "mscgen"
    brew "mypy"
    brew "nano"
    brew "ncdu"
    brew "nelm"
    brew "neovim"
    brew "netcat"
    brew "nmap"
    brew "numdiff"
    brew "oath-toolkit"
    brew "ocm"
    brew "ocrmypdf"
    brew "octosql"
    brew "onefetch"
    brew "opa"
    brew "openjdk"
    brew "openssh"
    brew "openssl"
    brew "openstackclient"
    brew "opentofu"
    brew "oq"
    brew "osv-scanner"
    brew "pdf2svg"
    brew "pdftk-java"
    brew "perl"
    brew "php"
    brew "pint"
    brew "pip-completion"
    brew "pipdeptree"
    brew "pixie"
    brew "plantuml"
    brew "pluto"
    brew "pmd"
    brew "poetry"
    brew "popeye"
    brew "postgresql@15"
    brew "potrace"
    brew "prettier"
    brew "proctools"
    brew "proguard"
    brew "proselint"
    brew "pwgen"
    brew "pyenv"
    brew "pyenv-virtualenv"
    brew "pylint"
    brew "pyright"
    brew "python"
    brew "qemu"
    brew "rakudo"
    brew "range2cidr"
    brew "redpen"
    brew "repo"
    brew "rich-cli"
    brew "ripgrep-all"
    brew "rlwrap"
    brew "rmlint"
    brew "rpm"
    brew "rsync"
    brew "ruff"
    brew "rust"
    brew "rustc-completion"
    brew "sad"
    brew "scorecard"
    brew "screen"
    brew "scriptisto"
    brew "sha3sum"
    brew "shellcheck"
    brew "shfmt"
    brew "skaffold"
    brew "skopeo"
    brew "sloccount"
    brew "snyk/tap/snyk"
    brew "snyk/tap/snyk-iac-rules"
    brew "socat"
    brew "sourcegraph/src-cli/src-cli"
    brew "speedtest-cli"
    brew "sqlfluff"
    brew "sqlite-analyzer"
    brew "sqlparse"
    brew "ssdeep"
    brew "ssh-copy-id"
    brew "sslscan"
    brew "stackql"
    brew "staticcheck"
    brew "steampipe"
    brew "stern"
    brew "stylua"
    brew "subnetcalc"
    brew "swift"
    brew "symlinks"
    brew "tbls"
    brew "tcpdump"
    brew "tcpreplay"
    brew "tcptraceroute"
    brew "tcsh"
    brew "teip"
    brew "temporal"
    brew "terminal-notifier"
    brew "terracognita"
    brew "terraform-docs"
    brew "terraform-graph-beautifier"
    brew "terraformer"
    brew "terrascan"
    brew "testssl"
    brew "texinfo"
    brew "tfk8s"
    brew "tflint"
    brew "tfmigrate"
    brew "tfmv"
    brew "tfsec"
    brew "tfsort"
    brew "tfupdate"
    brew "tika"
    brew "timg"
    brew "tlrc"
    brew "tmux"
    brew "topgrade"
    brew "tree"
    brew "treefmt"
    brew "trivy"
    brew "trurl"
    brew "ugrep"
    brew "uncrustify"
    brew "uni"
    brew "unifdef"
    brew "universal-ctags"
    brew "unzip"
    brew "util-linux"
    brew "valkey"
    brew "vhs"
    brew "vim"
    brew "virtualenv"
    brew "watch"
    brew "watchexec"
    brew "webp"
    brew "werf"
    brew "wget"
    brew "whois"
    brew "with-readline"
    brew "wrkflw"
    brew "xdg-ninja"
    brew "xidel"
    brew "yamllint"
    brew "yapf"
    brew "yarn"
    brew "yq"
    brew "yt-dlp"
    brew "zchunk"
    brew "zip"
    brew "zlib"
    brew "zlint"
    brew "zopfli"
    brew "zsh"

    cask "1password"
    cask "1password-cli"
    cask "chromedriver"
    cask "cursor"
    cask "docker-desktop"
    cask "font-code-new-roman-nerd-font"
    cask "ghostty"
    cask "git-credential-manager"
    cask "google-chrome"
    cask "google-cloud-sdk"
    cask "headlamp"
    cask "iterm2"
    cask "jetbrains-toolbox"
    cask "maccy"
    cask "microsoft-edge"
    cask "skim"
    cask "sqlcl"
    cask "utm"
    cask "visual-studio-code"
    cask "visualvm"
    cask "vivaldi"
    cask "zoom"
end

brew "actionlint"
brew "bazelisk"
brew "buildifier"
brew "buildozer"
brew "calicoctl"
brew "cpdf"
brew "dockerfilegraph"
brew "duckdb"
brew "f2"
brew "foremost"
brew "hashicorp/tap/terraform"
brew "json2hcl"
brew "jsonnet"
brew "jsonnet-bundler"
brew "krew"
brew "logdy"
brew "rsql"
brew "shellharden"
brew "soft-serve"
brew "tilt"
brew "usage"
brew "xq"

vscode "aykutsarac.jsoncrack-vscode"
vscode "bazelbuild.vscode-bazel"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.prompty"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "oracle.sql-developer"
vscode "sfdc.bazel-vscode-java"
vscode "vscjava.vscode-java-pack"
vscode "vscodevim.vim"
